In [1]:
# Dependencies and Setup
import pandas as pd
import csv
import os
import numpy as np

## Load and Clean Data

In [2]:
# Files to Load
cont_code_path = os.path.join(os.getcwd(), "Resources", "country-and-continent-codes-list-cleaned.csv")
teams_path = os.path.join(os.getcwd(), "Resources", "highest_earning_teams.csv")
players_path = os.path.join(os.getcwd(), "Resources", "highest_earning_players.csv")
time_trends_path = os.path.join(os.getcwd(), "Resources", "time_trends.csv")
trends_path = os.path.join(os.getcwd(), "Resources", "trend_map.csv")
general_data_path = os.path.join(os.getcwd(), "Resources", "GeneralEsportData.csv")
historical_data_path = os.path.join(os.getcwd(), "Resources", "HistoricalEsportData.csv")

In [3]:
# Read Files and Store Into Pandas Data Frame
cont_code_df = pd.read_csv(cont_code_path)
teams_df = pd.read_csv(teams_path)
players_df = pd.read_csv(players_path)
time_trends_df = pd.read_csv(time_trends_path)
trends_geo_df = pd.read_csv(trends_path)
general_data_df = pd.read_csv(general_data_path, encoding='cp1252')
historical_data_df = pd.read_csv(historical_data_path, encoding='cp1252')

In [4]:
## Look at our data
cont_code_df.head()

,Continent_Name,Continent_Code,Country_Name,Two_Letter_Country_Code,Three_Letter_Country_Code,Country_Number
0,Asia,AS,Afghanistan,AF,AFG,4.0
1,Europe,EU,Albania,AL,ALB,8.0
2,Antarctica,AN,Antarctica,AQ,ATA,10.0
3,Africa,AF,Algeria,DZ,DZA,12.0
4,Oceania,OC,American Samoa,AS,ASM,16.0

In [5]:
teams_df.head()

,TeamId,TeamName,TotalUSDPrize,TotalTournaments,Game,Genre
0,760,San Francisco Shock,3105000.0,7,Overwatch,First-Person Shooter
1,776,London Spitfire,1591136.5,13,Overwatch,First-Person Shooter
2,768,New York Excelsior,1572618.5,18,Overwatch,First-Person Shooter
3,773,Philadelphia Fusion,1186278.5,15,Overwatch,First-Person Shooter
4,766,Seoul Dynasty,1130000.0,6,Overwatch,First-Person Shooter

In [6]:
players_df.head()

,PlayerId,NameFirst,NameLast,CurrentHandle,CountryCode,TotalUSDPrize,Game,Genre
0,3883,Peter,Rasmussen,dupreeh,dk,1822989.41,Counter-Strike: Global Offensive,First-Person Shooter
1,3679,Andreas,Højsleth,Xyp9x,dk,1799288.57,Counter-Strike: Global Offensive,First-Person Shooter
2,3885,Nicolai,Reedtz,dev1ce,dk,1787489.88,Counter-Strike: Global Offensive,First-Person Shooter
3,3672,Lukas,Rossander,gla1ve,dk,1652350.75,Counter-Strike: Global Offensive,First-Person Shooter
4,17800,Emil,Reif,Magisk,dk,1416448.64,Counter-Strike: Global Offensive,First-Person Shooter

In [7]:
time_trends_df = time_trends_df.drop([0])
## Need to fix headers
new_header = time_trends_df.iloc[0]
time_trends_df = time_trends_df[1:]
time_trends_df.columns = new_header
time_trends_df = time_trends_df.rename(columns={"League of Legends: (Worldwide)" : "League_of_Legends", 
                                              "Dota 2: (Worldwide)" : "Dota_2",
                                              "Fortnite: (Worldwide)" : "Fortnite",
                                              "PlayerUnknown's Battlegrounds: (Worldwide)" : "PUBG",
                                              "Counter-Strike: Global Offensive: (Worldwide)" : "CSGO"
                                             })
time_trends_df.head()

1       Week League_of_Legends Dota_2 Fortnite PUBG CSGO
2   9/6/2020                26      5       74   76   11
3  9/13/2020                26      5       72   53   11
4  9/20/2020                27      5       72   45   11
5  9/27/2020                31      4       65   41   11
6  10/4/2020                30      4       57   39   10

In [8]:
trends_geo_df = trends_geo_df.drop([0])
## Need to fix headers
new_header = trends_geo_df.iloc[0]
trends_geo_df = trends_geo_df[1:]
trends_geo_df.columns = new_header
trends_geo_df = trends_geo_df.rename(columns={"League of Legends: (9/1/20 - 9/1/21)" : "League_of_Legends", 
                                              "Dota 2: (9/1/20 - 9/1/21)" : "Dota_2",
                                              "Fortnite: (9/1/20 - 9/1/21)" : "Fortnite",
                                              "PlayerUnknown's Battlegrounds: (9/1/20 - 9/1/21)" : "PUBG",
                                              "Counter-Strike: Global Offensive: (9/1/20 - 9/1/21)" : "CSGO"
                                             })
trends_geo_df.head()

1         Albania League_of_Legends Dota_2 Fortnite  PUBG CSGO
2         Algeria               <1%    <1%       9%   91%  <1%
3  American Samoa                2%     1%       3%   94%  <1%
4         Andorra                8%    11%       3%   75%   3%
5          Angola               NaN    NaN      NaN  100%  NaN
6        Anguilla                1%    <1%       7%   92%  <1%

In [9]:
general_data_df.drop(columns = ["Genre"]).head()

,Game,ReleaseDate,TotalEarnings,OnlineEarnings,TotalPlayers,TotalTournaments
0,Age of Empires,1997,190262.81,156839.89,255,96
1,Age of Empires II,1999,2008941.78,619582.87,1392,1031
2,Age of Empires III,2005,68613.85,41500.00,108,77
3,Age of Empires Online,2011,4853.56,775.00,20,13
4,Age of Mythology,2002,52360.00,52000.00,22,6

In [10]:
historical_data_df.head()

         Date        Game  Earnings  Players  Tournaments
0  1998-01-01  QuakeWorld   15000.0        8            1
1  1998-05-01    Quake II   14600.0        4            1
2  1998-07-01    Quake II   15000.0        5            1
3  1998-07-01  QuakeWorld    6500.0        4            1
4  1998-11-01    Quake II   36600.0       13            2

## Create Database

In [11]:
## Dependencies
from sqlalchemy import create_engine
from hiddenConfig import password
import psycopg2

In [12]:
## establishing the connection with database. This checks whether or not the database exists before creation. If it is,
## it will tell you. Then move onto the next cell
conn = None
try:
    conn = psycopg2.connect(
       database="postgres", user='postgres', password=password, host='127.0.0.1', port= '5432'
    )

except:
    print('Database not connected.')
    
if conn is not None:
    conn.autocommit = True

    #Creating a cursor object
    cursor = conn.cursor()

    cursor.execute("SELECT datname FROM pg_database;")
    
    list_database = cursor.fetchall()
    database_name = 'esports_db'
    
    if (database_name,) in list_database:
        print(f"'{database_name}' Database already exists")
    else:
        #Preparing query to create a database
        sql = '''CREATE database esports_db''';

        #Creating a database
        cursor.execute(sql)
        print("Database created successfully!")

    #Closing the connection
    conn.close()

'esports_db' Database already exists

In [13]:
## Connect to local database
rds_connection_string = f"postgres:{password}@localhost:5432/esports_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [14]:
## Check to see if there are any tables already in the database
engine.table_names()

['cont_code_data',
 'team_data',
 'trends_geo_data',
 'player_data',
 'time_trends_data',
 'general_data',
 'historical_data',
 'small_bar_race_data',
 'grouped_game_data',
 'grouped_bar_race_data']

#### Load the dataframes into our database

In [15]:
cont_code_df.to_sql(name='cont_code_data', con=engine, if_exists='replace', index=False)
teams_df.to_sql(name='team_data', con=engine, if_exists='replace', index=False)
trends_geo_df.to_sql(name='trends_geo_data', con=engine, if_exists='replace', index=False)
players_df.to_sql(name='player_data', con=engine, if_exists='replace', index=False)
time_trends_df.to_sql(name='time_trends_data', con=engine, if_exists='replace', index=False)
general_data_df.to_sql(name='general_data', con=engine, if_exists='replace', index=False)
historical_data_df.to_sql(name='historical_data', con=engine, if_exists='replace', index=False)

#### Check to make sure it worked OK

In [16]:
engine.execute('select * from cont_code_data').first()

('Asia', 'AS', 'Afghanistan', 'AF', 'AFG', 4.0)

In [17]:
engine.execute('select * from team_data').first()

(760, 'San Francisco Shock', 3105000.0, 7, 'Overwatch', 'First-Person Shooter')

In [18]:
engine.execute('select * from trends_geo_data').first()

('Algeria', '<1%', '<1%', '9%', '91%', '<1%')

In [19]:
engine.execute('select * from player_data').first()

(3883, 'Peter', 'Rasmussen', 'dupreeh', 'dk', 1822989.41, 'Counter-Strike: Global Offensive', 'First-Person Shooter')

In [20]:
engine.execute('select * from time_trends_data').first()

('9/6/2020', '26', '5', '74', '76', '11')

In [21]:
engine.execute('select * from general_data').first()

('Age of Empires', 1997, None, 190262.81, 156839.89, 255, 96)

In [22]:
engine.execute('select * from historical_data').first()

('1998-01-01', 'QuakeWorld', 15000.0, 8, 1)

In [23]:
historical_data_df['Date'] = pd.to_datetime(historical_data_df['Date'],format='%Y/%m/%d')

In [ ]:
historical_data_df.head()

## Create cleaned table for josiah endpoint

In [25]:
historical_data_df['year'] = pd.DatetimeIndex(historical_data_df['Date']).year
historical_data_df.head()

        Date        Game  Earnings  Players  Tournaments  year
0 1998-01-01  QuakeWorld   15000.0        8            1  1998
1 1998-05-01    Quake II   14600.0        4            1  1998
2 1998-07-01    Quake II   15000.0        5            1  1998
3 1998-07-01  QuakeWorld    6500.0        4            1  1998
4 1998-11-01    Quake II   36600.0       13            2  1998

In [26]:
grouped = historical_data_df.groupby(["Game", "year"]).agg({'Earnings' : ['sum']})

In [27]:
grouped = grouped.reset_index()
grouped = grouped.set_axis(['Game', 'Year', 'Earnings'], axis=1, inplace=False)
grouped.head()

   Game  Year  Earnings
0  ARMS  2017   3257.10
1  ARMS  2018  13297.14
2  ARMS  2019   1970.86
3  ARMS  2020    789.17
4  ARMS  2021    816.50

In [28]:
grouped.to_sql(name='grouped_game_data', con=engine, if_exists='replace', index=False)

In [29]:
engine.execute('select * from grouped_game_data').first()

('ARMS', 2017, 3257.1)

## Get data more similar to source code for duncan

In [30]:
for col in grouped.columns:
    print(col)

Game
Year
Earnings

In [31]:
newdf = historical_data_df.groupby(["year", "Game"]).agg({'Earnings' : ['sum']}).reset_index().set_axis(['Year', 'Game', 'Earnings'], axis=1, inplace=False)

In [32]:
newdf.head()

   Year                  Game  Earnings
0  1998        Age of Empires    2000.0
1  1998              Quake II   66200.0
2  1998            QuakeWorld   43500.0
3  1998  StarCraft: Brood War   20000.0
4  1999             Descent 3   50000.0

In [33]:
newdf.to_sql(name='grouped_bar_race_data', con=engine, if_exists='replace', index=False)
engine.execute('select * from grouped_bar_race_data').first()

(1998, 'Age of Empires', 2000.0)

In [34]:
newdf["Year"].max()

2021

In [35]:
newnewdf = newdf[(newdf['Year'] >= 2016)]

In [36]:
newnewdf.nlargest(5, 'Earnings')

      Year      Game     Earnings
1161  2019  Fortnite  72800079.01
1151  2019    Dota 2  47043520.56
995   2018    Dota 2  41457368.99
862   2017    Dota 2  38074599.32
739   2016    Dota 2  37464419.92

In [37]:
smaller_df = newnewdf.groupby(['Year'])['Earnings'].nlargest(10).reset_index().set_index('level_1')

In [38]:
indexed_smaller_df = smaller_df.join(newnewdf, how='left', lsuffix='_left', rsuffix='_right')

In [39]:
cleaned_df = indexed_smaller_df.drop(columns = ["Year_right", "Earnings_left"]).rename(columns = {"Year_left" : "Year", "Earnings_right" : "Earnings"}).reset_index()

In [40]:
cleaned_df = cleaned_df.drop(cleaned_df.columns[0], axis=1)

In [41]:
cleaned_df.head()

   Year                              Game     Earnings
0  2016                            Dota 2  37464419.92
1  2016  Counter-Strike: Global Offensive  17266132.50
2  2016                 League of Legends  10529309.95
3  2016               Heroes of the Storm   4663149.10
4  2016       Call of Duty: Black Ops III   3862185.84

In [43]:
cleaned_df.to_sql(name='small_bar_race_data', con=engine, if_exists='replace', index=False)
engine.execute('select * from small_bar_race_data').fetchall()

[(2016, 'Dota 2', 37464419.92),
 (2016, 'Counter-Strike: Global Offensive', 17266132.5),
 (2016, 'League of Legends', 10529309.95),
 (2016, 'Heroes of the Storm', 4663149.1),
 (2016, 'Call of Duty: Black Ops III', 3862185.84),
 (2016, 'Hearthstone', 3455125.46),
 (2016, 'Halo 5: Guardians', 3411240.03),
 (2016, 'StarCraft II', 3182918.35),
 (2016, 'Overwatch', 1996942.76),
 (2016, 'SMITE', 1638242.04),
 (2017, 'Dota 2', 38074599.32),
 (2017, 'Counter-Strike: Global Offensive', 19279544.51),
 (2017, 'League of Legends', 12233319.22),
 (2017, 'Heroes of the Storm', 5444449.54),
 (2017, 'Call of Duty: Infinite Warfare', 4031184.07),
 (2017, 'Overwatch', 3488230.1),
 (2017, 'Hearthstone', 3476623.09),
 (2017, 'StarCraft II', 3413355.85),
 (2017, 'Halo 5: Guardians', 1748000.0),
 (2017, 'SMITE', 1567900.0),
 (2018, 'Dota 2', 41457368.99),
 (2018, 'Counter-Strike: Global Offensive', 23320178.93),
 (2018, 'Fortnite', 19880337.0),
 (2018, 'League of Legends', 14590522.32),
 (2018, 'PLAYERUNKNOWN’S BATTLEGROUNDS', 8332616.32),
 (2018, 'Overwatch', 6615791.65),
 (2018, 'Heroes of the Storm', 5277279.76),
 (2018, 'Arena of Valor', 5190956.76),
 (2018, 'Hearthstone', 4717852.27),
 (2018, 'Call of Duty: World War II', 4287916.69),
 (2019, 'Fortnite', 72800079.01),
 (2019, 'Dota 2', 47043520.56),
 (2019, 'Counter-Strike: Global Offensive', 22199398.24),
 (2019, 'PLAYERUNKNOWN’S BATTLEGROUNDS', 11327221.08),
 (2019, 'League of Legends', 9608549.84),
 (2019, 'Overwatch', 9587036.77),
 (2019, 'Arena of Valor', 7821265.46),
 (2019, 'Call of Duty: Black Ops 4', 6383189.0),
 (2019, 'Rainbow Six Siege', 5066166.82),
 (2019, 'Hearthstone', 4772553.17),
 (2020, 'Counter-Strike: Global Offensive', 15893858.09),
 (2020, 'Arena of Valor', 9500997.45),
 (2020, 'Dota 2', 9372569.73),
 (2020, 'Fortnite', 8876401.39),
 (2020, 'League of Legends', 8466911.57),
 (2020, 'Call of Duty: Modern Warfare', 7152172.0),
 (2020, "PLAYERUNKNOWN'S BATTLEGROUNDS Mobile", 6187727.95),
 (2020, 'Rainbow Six Siege', 5612640.43),
 (2020, 'Overwatch', 5358996.0),
 (2020, 'PLAYERUNKNOWN’S BATTLEGROUNDS', 5101127.92),
 (2021, 'Counter-Strike: Global Offensive', 9977919.23),
 (2021, 'PLAYERUNKNOWN’S BATTLEGROUNDS', 7854153.0),
 (2021, 'Fortnite', 6120128.3),
 (2021, "PLAYERUNKNOWN'S BATTLEGROUNDS Mobile", 5974745.0),
 (2021, 'Call of Duty: Black Ops Cold War', 5777000.0),
 (2021, 'Dota 2', 5671750.51),
 (2021, 'Rainbow Six Siege', 4701810.98),
 (2021, 'Arena of Valor', 3831414.13),
 (2021, 'VALORANT', 3763375.24),
 (2021, 'Call of Duty: Warzone', 3566186.14)]

In [48]:
general_data_df["Game"].nunique()

538